Repository: wescamp/Trolls-1.4
Catalog: po/*.po
Languages: sk

source: Trolls!
sk: Trolovia!

source: Whelp
sk: Mláďa

source: (Beginner)
sk: (Ľahká)

source: Troll
sk: Trol

source: (Normal)
sk: (Normálna)

source: Warrior
sk: Bojovník

source: (Challenging)
sk: (Ťažká)

source: You are Eag, the leader of a troll tribe, who lives in a peaceful cave farming mushrooms for food. However a scout brings you bad news : dwarves are attempting to mine gold and other valuable minerals in the cave. They have attacked another tribe that is near you. Hearing the news you lead your fighters to help.
sk: Si Eag, vodca trolieho kmeňa, ktorý žije v jaskyni. Je to mierumilovný kmeň, ktorý pestuje muchotrávky. Nedávno však prieskumník priniesol zlé správy: trpaslíci prišli hľadať zlato a ďalšie hodnotné suroviny do tejto jaskyne. Napadli neďaleký kmeň trolov. Ty, vodca trolov, si dal pokyn na pochod - pomôcť napadnutým trolom.

source: Dwarvish Miners
sk: Trpasličí baníci

source: You are Eag, the leader of a troll tribe, who lives in a peaceful troll village built in the end of a deep cave. The troll people living there have not seen light for ages ... and have met only other trolls living in the near village...
sk: Si Eag, vodca trolieho kmeňa, ktorý žije v jaskyni. Už roky nevideli trolovia pod tvojim vedením slnečné svetlo, a nestretávali sa s nikým s výnimkou trolov z neďalekej jaskyne...

source: teamname^Trolls
sk: Trolovia

source: Eag The Wise
sk: Eag múdry

source: teamname^Dwarves
sk: Trpaslíci

source: Defeat the dwarves
sk: Porazíš trpaslíkov

source: Death of Aeg or Ug
sk: Zomrie Aeg alebo Ug

source: Turns run out
sk: Vyprší čas

source: Ug The Strong
sk: Ug mocný

source: Dwarves has attack me home. You must help. Leaders say so! Blackrock!
sk: Trpaslíci útočiť moje domov. Ty musíš prísť bojovať. Kmeň Blackrock!

source: You mean that dwarves have attacked Blackrock tribe?
sk: Ty tvrdíš, že trpaslíci zaútočili na kmeň Blackrock?

source: Yes!
sk: Áno!

source: Then we must help them.
sk: Potom im musíme pomôcť.

source: The help has arrived. Good work, Äg Äg. I though that dwarves might attack us so I hired some mercenaries.
sk: Pomoc dorazila. Dobrá práca, Äg Äg. Myslel som, že by na nás mohli trpaslíci priamo zaútočiť, preto som najal nejakých žoldnierov.

source: We really need help now. Some dwarves are coming from their encampment.
sk: Teraz naozaj potrebujeme pomoc. Niekoľko trpaslíkov prichádza z ich tábora.

source: Your village is now a safe place again, Ug.
sk: Tvoja dedina je znovu bezpečným miestom, Ug.

source: I afraid, it is not... Dwarves will come back soon.
sk: Bojím sa, že nie... trpaslíci sa určite vrátia.

source: Hmm... What is going on here?
sk: Hmmm... o čo tu ide?

source: More dwarves coming!
sk: Prichádzajú ďalší pajzlovia!

source: Argh! Trolls! I have to warn the lord!
sk: Argh! Trolovia! Musím varovať nášho vodcu!

source: Dwarvish Lord! He might be the one who commanded the dwarves to attack us... I suggest we follow that miner.
sk: Vodca pajzlov? Možno on je tom, čo má na starosti všetky tie útoky... Navrhujem prenasledovať toho baníka.

source: Agreed. Let's go!
sk: Súhlas. Pohyb!

source: Argh! I have betrayed my tribe...
sk: Argh! Zradil som svoj kmeň...

source: Nooo! You is good leaders!
sk: Nieee! Ty byť dobrý vodca!

source: Argh! This cannot be...
sk: Argh! To nemôže byť...

source: Nooo! Me must help Eag!
sk: Ach nie! Musíme pomôcť Eagovi!

source: The Chase
sk: Naháňačka

source: The party traveled into the cave and found no dwarves. However finally they hear the sound of dwarvish hammers ...
sk: Skupina sa presunula do iného konca jaskyne a našla trpaslíkov. Všade je počuť zvuk trpasličích kladív...

source: teamname^Bats
sk: Netopiere

source: Defeat the dwarf leader
sk: Porazíš vodcu trpaslíkov

source: Find a way out of cave.
sk: Nájdi východ z jaskyne

source: There are dwarves close to us. We need to be careful.
sk: Nablízku sú pajzlovia. Musíme byť opatrní.

source: I have always thought that trolls aren't as stupid as I have heard. But the fact that you attempt to attack a well-defended dwarven fortress makes me think that I have overestimated your intelligence... Uh... why am I standing in water?
sk: Vždy som si myslel, že trolovia nie sú až tak blbý ako sa o nich hovorí. Ale fakt, že chcú zaútočiť na tak dobre chránenú pevnosť... sú to úbohé tvory bez mozgu. A... prečo stojím vo vode?

source: Looks like that water is pouring through the wall. I think I have overestimated your skill to build.
sk: To vyzerá, že tu niekto poriadne spackal staviteľstvo. Asi by mali hrady pre trpaslíkov stavať odborníci...

source: Haha... Dwarves have decided to change their cave into a lake. I guess you are the one, Alher, who hired those poachers to hunt us. I am not sure what you are aiming for but I guess you want more power in this area... Finish him guys!
sk: Haha! Trpaslíci sa rozhodli zmeniť jaskyňu za jazero. Stavím sa, že ty si ten, Alher, ktorý najal tých amatérov aby nás pobili. Myslím, že nemáš dosť sily na to, aby si nás zastavil... dorazme ich, mládenci!

source: Nagas! Good to see you again. We will help you with the dwarves.
sk: Nagy! Rád Vás znovu vidím. Pomôžete nám proti trpaslíkom?

source: Trolls? Great to see you.
sk: Trolovia? Radi Vás vidíme.

source: The entrance is here. I think we need to activate those runes in two rooms to open the gate.
sk: Tu je vchod. Mali by sme aktivovať tie runy, aby sme otvorili tú bránu.

source: Yay. Me want seen the outside!
sk: Ja chcieť vidieť von!

source: The gates opens now!
sk: Brána sa otvára!

source: We still have to kill that dwarf. He is too dangerous to be left alive!
sk: Musíme zakilovať toho pajzla. Kto vie, čo by mohol spôsobiť?

source: Finally that dwarf died...
sk: Konečne je trpaslík mŕtvy...

source: Let's find a way out from this cave... We can't stay here anymore.
sk: Poďme nájsť cestu von z týchto jaskýň... už tu nemôžeme ostať.

source: Old Friend
sk: Starý priateľ

source: teamname^Enemy
sk: Nepriatelia

source: Defeat enemy leaders
sk: Porazíš nepriateľských veliteľov

source: Move Karak out of the cave.
sk: Dostaneš Karaka von z jaskýň.

source: Death of Aeg, Ug or Karak
sk: Zomrie Aeg, Ug alebo Karak

source: There is an orcish encampment near us. I suggest we try to sneak past it as I don't want to lose any more men. When we are far away from the dwarves, we have to find a new cave in which to live.
sk: Neďaleko od nás je táborisko orkov. Navrhujem, aby sme sa pokúsili prekĺznuť popri nich. Nechcem strácať ďalších bojovníkov. Keď budeme ďaleko od trpaslíkov, nájdeme si inú jaskyňu, v ktorej budeme žiť.

source: I know one friendly orcish tribe which isn't warlike like other tribes. They also have a cave near their encampment for trolls.
sk: Viem o jednom kmeni orkov, ktorý nie je taký bojovný ako ostatné. Taktiež tu majú neďaleko jaskyňu.

source: ~Luckily I found you Eag. Can you help me? An orcish leader has kidnapped us and throw us into a dark cave which seems to be full of bats...
sk: ~Našťastie som ťa našiel, Eag. Pomôžeš mi? Ork vojvoda nás tu drží ako myši v jaskyni plnej netopierov...

source: ~Karak? Why are you talking in my head?
sk: ~Karak? Prečo počujem v hlave tvoj hlas?

source: ~It is a shaman thing, you know Please, come to help me and my friends I will make up this some day
sk: ~To je vecou šamanov, ovládame to. Teraz prosím príď a pomôž mne a mojim priateľom. Raz Ti to vrátim.

source: ~We will help you, don't worry.
sk: ~Pomôžeme, nemusíš sa báť.

source: We have to change our plan now... We must attack the orcs. Let me explain...
sk: Musíme zmeniť svoje plány. Zaútočíme na orkov. Nechajte ma to vysvetliť...

source: No! No one can defeat me!
sk: Nie! Nikto ma nemôže poraziť!

source: Haha, my army is unstoppable!
sk: Haha, moja armáda je nezastaviteľná!

source: Uh, you have won... I died against a good enemy...
sk: Uh, vyhral si... porazil ma skutočne mocný nepriateľ...

source: I finally got out of there.
sk: Konečne som sa odtiaľ dostal.

source: Night of Daggers
sk: Noc dýk.

source: A Long Dark Night
sk: Dlhá tmavá noc

source: teamname^Black Assassins
sk: Čierny zabijaci

source: Eag and his company travelled to an encampment of a peaceful tribe. They noticed that the tribe has a new leader. Eag has his doubts about the new commander, but they decide to stay the night. The night was cold and darker than it was normally. At midnight they heard someone screaming.
sk: Eag a jeho družina šiel do tábora mierumilovného kmeňa. Oznámili mu, že kmeň má nového vodcu. Eag bol zvedavý na nového veliteľa, no rozhodol sa prečkať noc. Tá bola tmavá a veľmi chladná, chladnejšia ako obyčajne v tomto kraji. O polnoci začul každý niekoho výkrik.

source: Survive 20 turns
sk: Udržíš sa 20 kôl

source: Death of all enemies
sk: Porazíš všetkých nepriateľov

source: Black Assassins are attacking us! Kill them all and in the morning we will revenge this coward attack!
sk: Čierny zabijaci na nás útočia! Zabi ich všetkých a ráno sa pomstíme za ich zbabelý útok!

source: Night has finally ended and black assassins can't hide in the darkness anymore. Victory will be ours!
sk: Noc sa konečne skončila a čierny zabijaci sa už nemôžu viac skrývať v tme. Víťazstvo je naše!

source: Naga Abomination
sk: Mocný hadí bojovník

source: These heavy fighters are elite forces of the nagas.
sk: Tieto ťažko ozbrojené jednotky sú elitou svojho národa

source: sword
sk: meč

source: mace
sk: palcát

source: spear
sk: kopija

source: Naga Assassin
sk: Hadí zabijak

source: Naga Hunters are Naga who are skilled at hunting with a bow. Since the naga are naturally resistant to poison, they have no qualms about hunting with poisoned arrows. These two foot long shafts, tipped with a potent poison, have been known to slay many kinds of prey.
sk: Hadí lovci sú nebezpečné jednotky, pripravené používať svoje luky so šípmi napustenými jedom. Sú odolné voči jednu, ktorým rýchlo zabijú akúkoľvek obeť.

source: bow
sk: luk

source: Black Assassin
sk: Čierny zabijak

source: Some Orcish Assassins have decided to wear black and lightweight suits so that they will be unseen in darkness and can move faster around. They can sneak behind and accurately backstab their enemies or throw poison knives.
sk: Niekoľko orkských zabijakov sa rozhodlo nosiť čierne ľahké oblečenie, s ktorým môžu nikým nevidení pohybovať sa v temnote. Môžu sa rýchlo pohybovať, zákerne používať svoju dýku alebo hádzať otrávené vrhacie nože.

source: dagger
sk: dýka

source: throwing knives
sk: vrhacie nože

source: Black Slayer
sk: Čierny vrah

source: The larger or more skilled orcish assassins are called 'Slayers' by their enemies. Slayers are fast on their feet, and quite nimble in combat, although they achieve that end by forgoing armor. Their weapon of choice, poison, is a vicious tool, and its common use on the battlefield is often the real cause of orcish supremacy.
sk: Väčší a silnejší orkovia zabijaci sa nazývajú "vrahovia". Vrahovia sú rýchli, mocní v boji a veľmi zručne využívajú jed.

source: Naga Depthprowler
sk: Hadí potápač

source: Some nagas, whether through cowardice or cunning, develop a knack for surviving in darker depths of the water. After special training, this knowledge can develop into an entirely different branch of combat, although it is just as deadly. Naga Depthstalkers are especially valued as brood guardians, where they keep watch over eggs laid in hidden caves.
sk: Niektorí hadí bojovníci sa zdokonaľujú v potápaní. Či už je to kvôli zbabelosti alebo šikovnosti, dostávajú tréning, vďaka ktorému môžu bojovať veľmi účinne aj v hlbinách. Často sa používajú na stráženie vajec.

source: Nagini Depthprowler
sk: Hadia potápačka

source: Some naganis, whether through cowardice or cunning, develop a knack for surviving in darker depths of the water. After special training, this knowledge can develop into an entirely different branch of combat, although it is just as deadly. Nagani Depthstalkers are especially valued as brood guardians, where they keep watch over eggs laid in hidden caves.
sk: Niektoré hadie bojovnice sa zdokonaľujú v potápaní. Či už je to kvôli zbabelosti alebo šikovnosti, dostávajú tréning, vďaka ktorému môžu bojovať veľmi účinne aj v hlbinách. Často sa používajú na stráženie vajec.

source: Naga Depthstalker
sk: Hadí Potápač

source: Nagini Depthstalker
sk: Hadia potápačka

source: Dwarvish Miner
sk: Trpasličí baník

source: Dwarvish miners are the grunt workers of Dwarvish society. They take the precious ores out of the ground, but do not ever take part in the crafting of weapons or artifacts.
sk: Trpasličí baníci sú hlavnou silou trpasličej spoločnosti. Získavajú kvalitné rudy z hlbokých baní, no nemiešajú sa do výroby zbraní a artefaktov.

source: pick
sk: krompáč

source: Naga Hunter
sk: Hadí lovec

source: Old Orcish Shaman
sk: Starý orkský šaman

source: Orcish Shamans are the guardians of orcish magic. Respected among orcish tribes, they form the Orcish Council, which makes important decisions for the whole Orcish community and arbitrates the many conflicts that arise between tribes of this argumentative race. Although physically weak (for Orcs), Orcish Shamans are good spell casters and can curse their enemies, draining their life. Old Orcish Shamans are shamans that have mastered magic, although their physical strength has declined with age.
sk: Šamani sú strážcami orkskej mágie. Starší z kmeňov sa stretávajú na stretnutiach šamanov, kde sa rozhoduje o dôležitých rozhodnutiach pre celé komunity orkov a utlmujú vzájomne spory. Napriek fyzickej slabosti (na orkov), šamani sú schopný zosielať mocné kúzla.

source: staff
sk: palica

source: curse
sk: kliatba

source: Orcish Shaman
sk: Orkský šaman

source: Orcish Shamans are the guardians of orcish magic. Respected among orcish tribes, they form the Orcish Council, which makes important decisions for the whole Orcish community and arbitrates the many conflicts that arise between tribes of this argumentative race. Although physically weak (for Orcs), Orcish Shamans are good spell casters and can curse their enemies, draining their life.
sk: Šamani sú strážcami orkskej mágie. Starší z kmeňov sa stretávajú na stretnutiach šamanov, kde sa rozhoduje o dôležitých rozhodnutiach pre celé komunity orkov a utlmujú vzájomne spory. Napriek fyzickej slabosti (na orkov), šamani sú schopný zosielať mocné kúzla.

source: Naga Sentinel
sk: Hadí strážca

source: These heavy fighters are elite guards of the naga, choosen by their dedication and skill, their purpose is to defend their sleeping brethen from any menace or guarding their hidden cities from outside invasors until the great awake of their civilization arrive. These nagas are mostly unknow in Wesnoth since they can only be found near Naga cities.
sk: Elitné jednotky hadích bojovníkov. Ich úloha je chrániť spiacich bratov pred každou hrozbou. Týchto hadích bojovníkov vo väčšine Wesnothu vôbec nepoznajú.

source: Troll Shaman
sk: Trol šaman

source: Troll shamans are the mystical leaders of the trolls. Though not as strong or tough as other trolls, their true power lies in their fire magic, which they use to blast enemies with gouts of fire.
sk: Trolí šamani sú mystickými vodcami trolov. Aj keď nie sú tak silný ako ostatní trolovia, ich skutočná sila sa skrýva v tajomnej červenej mágii, s ktorou môžu zničiť zástupy nepriateľov.

source: fist
sk: päsť

source: flame blast
sk: Ohnivá strela

source: Naga Warden
sk: Naga dozorca

source: These heavy fighters are the elite guards of the naga. They are slower and more heavily armored than most naga and wield huge maces which they use to crush their enemies. They mostly guard naga outposts, but occasionally participate in offensive raids.
sk: Aj keď sú dozorcovia pomalších, majú silné brnenie, ktoré ich veľmi dobre chráni. Najčastejšie strážia dôležité miesta, len zriedka sa podieľajú na útokoch.

source: Whelp Shaman
sk: Mladý šaman

source: Describing a troll as a whelp is something of an oxymoron, given that their bodies are already much hardier than that of a grown man. They are clumsy and not yet capable of walking properly, forced instead to shamble about on all fours, but any difficulty this causes them is more than made up for by the raw strength of their race.
sk: Tieto mláďatá majú zvláštne nadanie pre ohnivé kúzla.
